/*****************************************************************************
  * @file       : at24c02
  * @brief      : null
  * @note       : null
  * @version    : V1.0
  * @date       : 2017-7-25
******************************************************************************/


#ifndef _AT24C02_H_
#define _AT24C02_H_


//.H
/*============条件编译========================================================*/

/*============标准库头文件====================================================*/

/*============非标准库头文件==================================================*/

/*============全局 常量声明 extern ===========================================*/

/*============全局 宏声明=====================================================*/
#define BUFF_SIZE   12
/*============全局 数据类型声明===============================================*/
typedef struct
{
    uint8_t update;
    uint8_t write_data[BUFF_SIZE];
    uint8_t read_data[BUFF_SIZE];
    uint8_t step;

} AT24C02_Struct;
/*============全局 变量声明 extern ===========================================*/
extern AT24C02_Struct at24c02;
/*============全局 函数原型声明===============================================*/
uint8_t at24c02_write_byte_reg( uint8_t reg, uint8_t wdata );
uint8_t at24c02_read_byte_reg( uint8_t reg, uint8_t *buf, uint8_t length );

void at24c02_write_flow( void );
void at24c02_update_data( uint8_t reset );
void at24c02_factory_reset( void );
void at24c02_init( void );


#endif

